; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	image1 - mode
	image3 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation3 - direction
	Star2 - direction
	Star5 - direction
	Star4 - direction
	Star1 - direction
	GroundStation0 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star6)
	(supports instrument1 image3)
	(supports instrument1 spectrograph4)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star6)
	(supports instrument2 image3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star6)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star5)
	(supports instrument6 image1)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(supports instrument7 spectrograph4)
	(supports instrument7 image3)
	(supports instrument7 image1)
	(calibration_target instrument7 Star1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument8 spectrograph4)
	(supports instrument8 image1)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Planet7 image3)
	(have_image Phenomenon8 spectrograph4)
	(have_image Star9 spectrograph4)
	(have_image Phenomenon10 spectrograph4)
	(have_image Star11 image1)
))

)

; plan
1. (turn_to satellite1 star1 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
2. (switch_on instrument7 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument7)
   goals met: 0 of 6
3. (calibrate satellite1 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon8 instrument7 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 6
7. (turn_to satellite0 groundstation3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 6
8. (take_image satellite1 phenomenon10 instrument7 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 3 of 6
9. (turn_to satellite1 planet7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet7)
   goals met: 3 of 6
10. (take_image satellite1 planet7 instrument7 image3)
   added: (have_image planet7 image3)
   goals met: 4 of 6
11. (turn_to satellite1 star11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star11)
   goals met: 4 of 6
12. (take_image satellite1 star11 instrument7 image1)
   added: (have_image star11 image1)
   goals met: 5 of 6
13. (turn_to satellite1 star9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star9)
   goals met: 5 of 6
14. (take_image satellite1 star9 instrument7 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 6 of 6
